project.org
* Art of study Project

** Plan
*** Control panel consists of parts for CRUD operations on:
    - Note taken on [2013-05-24 Пт. 01:49] \\
      cs
    - Note taken on [2013-05-24 Пт. 01:49] \\
      test

1. news
     no comments
2. pages (may include different parts):
   1. simple text (marked up)
      + components:
        - wysiwyg w file upload ext
   2. forms
      + form builder
        + fields setting
          + control select
          + attribs setting
          + control's addintional handler select
        + form handler select
      + future:form styling
        + scheme select (or/and)
        + each control styling.

3. blocks (see below)

4. menues
   + top and side (only items w subitems), etc. (depending on design)

5. blocks
   + different text parts (blocks) of a page

*** TODO site:frontend

*** TODO site:backend

*** TODO js
