project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>project</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-24 02:24:15 MSK"/>
<meta name="author" content="makaroni"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">project</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Art of study Project </a>
<ul>
<li><a href="#sec-1.1">1.1 Plan </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Control panel consists of parts for CRUD operations on: </a></li>
<li><a href="#sec-1.1.2">1.1.2 site:frontend </a></li>
<li><a href="#sec-1.1.3">1.1.3 site:backend </a></li>
<li><a href="#sec-1.1.4">1.1.4 js </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Art of study Project </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Plan </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Control panel consists of parts for CRUD operations on: </h4>
<div class="outline-text-4" id="text-1.1.1">

<ul>
<li>
Note taken on <span class="timestamp-wrapper"> <span class="timestamp">2013-05-24 Пт. 01:49</span></span> <br/>
cs
</li>
<li>
Note taken on <span class="timestamp-wrapper"> <span class="timestamp">2013-05-24 Пт. 01:49</span></span> <br/>
test

</li>
</ul>
<ol>
<li>
news
no comments
</li>
<li>
pages (may include different parts):
<ol>
<li>
simple text (marked up)
<ul>
<li>
components:
<ul>
<li>
wysiwyg w file upload ext
</li>
</ul>
</li>
</ul>
</li>
<li>
forms
<ul>
<li>
form builder
<ul>
<li>
fields setting
<ul>
<li>
control select
</li>
<li>
attribs setting
</li>
<li>
control's addintional handler select
</li>
</ul>
</li>
<li>
form handler select
</li>
</ul>
</li>
<li>
future:form styling
<ul>
<li>
scheme select (or/and)
</li>
<li>
each control styling.

</li>
</ul>
</li>
</ul>
</li>
</ol>
</li>
<li>
blocks (see below)

</li>
<li>
menues
<ul>
<li>
top and side (only items w subitems), etc. (depending on design)

</li>
</ul>
</li>
<li>
blocks
<ul>
<li>
different text parts (blocks) of a page

</li>
</ul>
</li>
</ol>
</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> <span class="todo TODO"> TODO</span> site:frontend </h4>
<div class="outline-text-4" id="text-1.1.2">


</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> <span class="todo TODO"> TODO</span> site:backend </h4>
<div class="outline-text-4" id="text-1.1.3">


</div>

</div>

<div id="outline-container-1.1.4" class="outline-4">
<h4 id="sec-1.1.4"><span class="section-number-4">1.1.4</span> <span class="todo TODO"> TODO</span> js </h4>
<div class="outline-text-4" id="text-1.1.4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">dfdfv</th><th scope="col">dfv</th><th scope="col">dfvdf</th><th scope="col">dfv</th><th scope="col">dfv</th></tr>
</thead>
<tbody>
<tr><td>\</td><td>&lt;</td><td>&lt;</td><td>&lt;</td><td>&lt;</td></tr>
<tr><td>1</td><td>10</td><td>30</td><td>3</td><td>dr</td></tr>
</tbody>
<tbody>
<tr><td>3</td><td>4</td><td>1</td><td>t</td><td>w</td></tr>
</tbody>
<tbody>
<tr><td>sdv</td><td>fv</td><td>ef</td><td>sdfv158,9</td><td>vf</td></tr>
</tbody>
<tbody>
</tbody>
<tbody>
<tr><td>dsfv</td><td>&lt;5&gt;</td><td>dfvfv</td><td></td><td>sdfvbsfd</td></tr>
</tbody>
<tbody>
<tr><td>df</td><td>dfbv</td><td>aerg</td><td>fvb</td><td>dsfv</td></tr>
<tr><td>sfv</td><td>dfbv</td><td>sfv</td><td>dfv</td><td>df</td></tr>
</tbody>
<tbody>
<tr><td>dfvdsfv</td><td>fdsv</td><td>dfdfvdfv</td><td>sfv</td><td>1</td></tr>
</tbody>
</table>


</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: makaroni
<a href="mailto:makaroni@makaroni-netbook">&lt;makaroni@makaroni-netbook&gt;</a>
</p>
<p class="date"> Date: 2013-05-24 02:24:15 MSK</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
